phase5_1_natural/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions

# ----------------------------------------------------------------------------
# 0. メッシュは既に生成済みのため、ここではスキップ
# (blockMesh, snappyHexMesh, topoSet, splitMeshRegions は実行済み)
# ----------------------------------------------------------------------------

# ----------------------------------------------------------------------------
# 1. 各領域に 0.orig/ をコピー
# ----------------------------------------------------------------------------
for region in air chip substrate
do
    rm -rf 0/$region
    mkdir -p 0/$region
    cp 0.orig/* 0/$region/
done

# ----------------------------------------------------------------------------
# 2. 固体領域から流体専用フィールドを削除
# ----------------------------------------------------------------------------
for region in chip substrate
do
    rm -f 0/$region/U
    rm -f 0/$region/p_rgh
done

# ----------------------------------------------------------------------------
# 3. 各領域の境界条件を changeDictionary で適用
# ----------------------------------------------------------------------------
for region in air chip substrate
do
    runApplication -s $region changeDictionary -region $region
done

# ----------------------------------------------------------------------------
# 4. CHT 計算実行
# ----------------------------------------------------------------------------
runApplication $(getApplication)

echo
echo "End"
