phase5_1_natural/constant/chip/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/chip/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    chip_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          320;
        startFace       480;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_chip;
    }
    chip_to_substrate
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          256;
        startFace       800;
        sampleMode      nearestPatchFace;
        sampleRegion    substrate;
        samplePatch     substrate_to_chip;
    }
)

// ************************************************************************* //
