phase5_1_natural/constant/substrate/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/substrate";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   63.55;          // Cu原子量
    }

    transport
    {
        kappa       400;            // 銅の熱伝導率 W/(m·K)
    }

    thermodynamics
    {
        Hf          0;
        Cp          385;            // 銅の比熱 J/(kg·K)
    }

    equationOfState
    {
        rho         8960;           // 銅の密度 kg/m³
    }
}

// ************************************************************************* //
